driver-tests/bpelse/dynamicpartnerlink/correlation/correlationJbi/test/CorrInvRecW1B6_Correlation/Input1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inv="CorrInvRecParent">
  <soapenv:Body>
    <inv:CorrInvRecParentElement>
      <inv:string>input</inv:string>
    </inv:CorrInvRecParentElement>
  </soapenv:Body>
</soapenv:Envelope>